In [1]:
info = ""
n = int(input("Enter n ="))
for i in range(1,n+1):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter address = ")
    phone = int(input("Enter phone ="))
    info = info + f"{name},{age},{add},{phone}\n"
    
file = open("info.csv","w")
file.write("sn,name,age,add,phone")
file.write(info)
file.close

Enter n =6
Enter name = ram
Enter age = 78
Enter address = bhaktapur
Enter phone =77777777777
Enter name = shyam
Enter age = 67
Enter address = kathmandu
Enter phone =999999999
Enter name = sita
Enter age = 45
Enter address = lalitpur
Enter phone =333333333333
Enter name = rita
Enter age = 34
Enter address = chabahil
Enter phone =0023442322
Enter name = puja
Enter age = 12
Enter address = kalanki
Enter phone =12345332
Enter name = dina
Enter age = 45
Enter address = kapan
Enter phone =45334373

In [2]:
import pandas as pd
df = pd.read_csv('info (1).csv')
df

    name  age        add       phone  sn
0    Ram   23  Kathmandu  9808778766   1
1  Shyam   34  Kathmandu   988986754   2
2   Hari   22   lalitpur  9808778765   3
3   Sita   29   Lalitpur  9808556543   4
4  Sabin   34      Jhapa  9808667654   5
5  Akash   34    Chitwan  9808667634   6

In [4]:
df = pd.read_csv('info (1).csv',index_col = 'sn')
df

     name  age        add       phone
sn
1     Ram   23  Kathmandu  9808778766
2   Shyam   34  Kathmandu   988986754
3    Hari   22   lalitpur  9808778765
4    Sita   29   Lalitpur  9808556543
5   Sabin   34      Jhapa  9808667654
6   Akash   34    Chitwan  9808667634

In [6]:
df.shape

(6, 4)

In [8]:
row, col = df.shape
print("No of rows = ",row)
print("No of col = ",col)

No of rows =  6
No of col =  4

In [12]:
#iloc
df = pd.read_csv('info (1).csv',index_col = 'sn')
df.iloc [1:4]

     name  age        add       phone
sn
2   Shyam   34  Kathmandu   988986754
3    Hari   22   lalitpur  9808778765
4    Sita   29   Lalitpur  9808556543

In [14]:
df = pd.read_csv('info (1).csv',index_col = 'sn')
df.iloc[1:4,1:3]

    age        add
sn
2    34  Kathmandu
3    22   lalitpur
4    29   Lalitpur

In [16]:
#loc  : how to filter the data
df = pd.read_csv('info (1).csv',index_col = 'sn')
df.ioc["Shyam":"Sabin"]

AttributeError: 'DataFrame' object has no attribute 'ioc'

In [20]:
df = pd.read_csv('info (1).csv',index_col = 'sn')
df

     name  age        add       phone
sn
1     Ram   23  Kathmandu  9808778766
2   Shyam   34  Kathmandu   988986754
3    Hari   22   lalitpur  9808778765
4    Sita   29   Lalitpur  9808556543
5   Sabin   34      Jhapa  9808667654
6   Akash   34    Chitwan  9808667634

In [22]:
#filtering the dataframe 
df[df['name']] == 'Ram' ]

SyntaxError: unmatched ']' (3477311768.py, line 2)

In [24]:
df[(df['age']>= 30) and (df['add'] == 'Kathmandu')]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [26]:
# create a dataframe
data = {'sn':[1,2,3],
       'name': ['Ram','Shyam','Hari'],
       'age': [34,56,32],
       'add':['Kathmandu','Bhaktapur','Lalitpur']}
df = pd.DataFrame(data)
df

   sn   name  age        add
0   1    Ram   34  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   32   Lalitpur

In [ ]:
df.to_csv('new_data.csv')

In [28]:
#if we have data in list
data =[['sn', 'name', 'age','add'],
      [1,'Ram',34,'Kathmandu'],
      [2,'Shyam',33,'Bhaktapur']]
file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)    #stores the given list in the form of rows in the file
file.close()

NameError: name 'csv' is not defined

In [19]:
#concatenation in the dataframe 
import pandas as pd

df1 = pd.DataFrame(
    {'name':['Ram','Hari'],
    'phone': [9813699056,9841014993]}
)
df2 = pd.DataFrame(
    {'name':['Rama','Harry'],
    'phone': [981369905634,984101499334]}
)
pd.concat([df1,df2])

    name         phone
0    Ram    9813699056
1   Hari    9841014993
0   Rama  981369905634
1  Harry  984101499334